/**
  ******************************************************************************
  * @文件         ck_out.h
  * @作者         LGG
  * @版本         V1.0.0
  * @日期         2018-3-16
  * @摘要         ck_out头文件
  ******************************************************************************
*/ 


/* 定义防止递归包含 ----------------------------------------------------------*/
#ifndef __CK_OUT__H
#define __CK_OUT__H


/* 包含头文件 ----------------------------------------------------------------*/
#include "gd32f1x0.h"


/* 宏定义 --------------------------------------------------------------------*/
/* 定义CK_OUT IO PORT与PIN */
#define CK_OUT_CLOCK			RCU_GPIOA
#define	CK_OUT_PORT				GPIOA
#define CK_OUT_PIN				GPIO_PIN_8


/* 函数声明-------------------------------------------------------------------*/
void CK_OUT_Config(uint32_t ckout_src, uint32_t ckout_div);

#endif



/************************ Copyright (C)2018 LGG. All Rights Reserved *****END OF FILE****/


