/**
  ******************************************************************************
  * @文件         main.c
  * @作者         LGG
  * @版本         V1.0.0
  * @日期         2018-3-16
  * @摘要         KEY例程
  ******************************************************************************
  * @attention
  * 技新网         www.jixin.pro
  * 硬件平台       技新GD32F130G8U6核心板
  * 程序效果       KEY按下，LED1状态发生改变
  ******************************************************************************
  */


/* 包含头文件 ----------------------------------------------------------------*/
#include "gd32f1x0.h"
#include "gd32f1x0_libopt.h"
#include "systick.h"
#include "led.h"
#include "key.h"


/**
  * @函数名       main
  * @功  能       主函数入口
  * @参  数       无
  * @返回值       无
  */
int main(void)
{
	uint8_t temp;	//定义变量用于读取按键值
	
	systick_config();	//初始化滴答定时器
	LED_Init();	//LED初始化
	KEY_Init();	//KEY初始化
	
	while(1)
	{
		temp = KEY_Scan();	//读取按键值
		if(temp == KEY_PRES)	//如果按键按下
			LED1_Toggle();	//切换LED1状态
	}
}


/************************ Copyright (C)2018 LGG. All Rights Reserved *****END OF FILE****/



