/**
  ******************************************************************************
  * @文件         key.h
  * @作者         LGG
  * @版本         V1.0.0
  * @日期         2018-3-16
  * @摘要         key头文件
  ******************************************************************************
*/ 


/* 定义防止递归包含 ----------------------------------------------------------*/
#ifndef __KEY__H
#define __KEY__H


/* 包含头文件 ----------------------------------------------------------------*/
#include "gd32f1x0.h"


/* 宏定义 --------------------------------------------------------------------*/
/* 定义KEY IO PORT与PIN */
#define KEY_CLOCK				RCU_GPIOA
#define	KEY_PORT				GPIOA
#define KEY_PIN					GPIO_PIN_15


/* 定义KEY按下时的返回值 */
#define KEY_PRES				0x01

/* 读取KEY值 */
#define KEY_READ				gpio_input_bit_get(KEY_PORT, KEY_PIN)


/* 函数声明-------------------------------------------------------------------*/
void KEY_Init(void);
uint8_t KEY_Scan(void);

#endif



/************************ Copyright (C)2018 LGG. All Rights Reserved *****END OF FILE****/


